# sudo apt install git - установка  системы контроля версий (кода)
# git - система контроля версий - программа для управления версиями кода

# github - сервис для хранение кода 

# репозиторий - папка с которой может взаимодействовать git


# git init - превращает текущую директорию в git репозитории

# git status - проверка статуса репозитория

# git add <file_name> / git add . - добавить файлы к отслеживанию изменений

# git commit -m "коментарий к версии " - сохранения версии кода / создание коммита

# git remote add <название_переменной> (принято называть "origin") <ссылка-на-удаленный-репозитории(ssh, htpts)> - соедеинение  локального репозитория с удаленным

# git push <название_переменной> <название_ветки> - отправка версии на github




